In [11]:
import numpy as np
import pandas as pd

In [28]:
data = {'Company':['GOOGLE','GOOGLE','MSFT','MSFT','FB','FB'],
       'Person':['SAM','CHARLIE','AMY','VANESSA','CARL','SARAH'],
       'Sales':[200,120,340,124,243,350]}


df = pd.DataFrame(data)
df

  Company   Person  Sales
0  GOOGLE      SAM    200
1  GOOGLE  CHARLIE    120
2    MSFT      AMY    340
3    MSFT  VANESSA    124
4      FB     CARL    243
5      FB    SARAH    350

In [31]:
bycompany=df.groupby('Company')

In [32]:
bycompany.mean()

         Sales
Company
FB       296.5
GOOGLE   160.0
MSFT     232.0

In [33]:
bycompany.sum()

         Sales
Company
FB         593
GOOGLE     320
MSFT       464

In [34]:
bycompany.std()

              Sales
Company
FB        75.660426
GOOGLE    56.568542
MSFT     152.735065

In [38]:
bycompany.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [40]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOGLE        2      2
MSFT          2      2

In [41]:
df.groupby('Company').max()

          Person  Sales
Company
FB         SARAH    350
GOOGLE       SAM    200
MSFT     VANESSA    340

In [42]:
df.groupby('Company').min()

          Person  Sales
Company
FB          CARL    243
GOOGLE   CHARLIE    120
MSFT         AMY    124

In [46]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOGLE    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [47]:
df.groupby('Company').describe().transpose()

Company              FB      GOOGLE        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [48]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64